[
  {
    "category": "Standard Room",
    "description": "Embrace comfort in our Standard Rooms. These cozy retreats are meticulously designed to provide you with a pleasant and restful stay. Unwind in a tranquil ambiance equipped with all the essentials you need for a comfortable experience. Whether you are here for business or leisure, our Standard Rooms are the ideal choice. Priced at $100 per night, these rooms are perfect for two guests, offering a single bed for a peaceful night's sleep. Rest assured, we maintain a pet-free and child-free environment, ensuring a serene atmosphere for all our guests.",
    "pricePerNight": 100,
    "personCapacity": 2,
    "numBeds": 1,
    "roomImages": "https://i.ibb.co/60dWHTC/standard.jpg",
    "featureImage": "https://i.ibb.co/RyRx7Xj/standard-feature.jpg",
    "petsAllowed": false,
    "childrenAndExtraBeds": false,
    "extraServices": []
  },
  {
    "category": "Deluxe Room",
    "description": "Indulge in elegance and spaciousness in our Deluxe Rooms. These well-appointed rooms offer a touch of luxury, featuring extra amenities and even a convenient mini-bar. Experience a lavish stay with all the modern comforts you desire. Ideal for both business and leisure travelers, our Deluxe Rooms are priced at $150 per night. With a capacity for two guests and a single bed, you'll find these rooms perfect for a comfortable retreat. Feel free to bring your pets along as we welcome them with open arms. If you're traveling with children or require extra beds, we have you covered. Additionally, our extra services, including a bar and pub and a summer terrace, ensure a delightful stay.",
    "pricePerNight": 150,
    "personCapacity": 2,
    "numBeds": 1,
    "roomImages": "https://i.ibb.co/nkVw2Xy/deluxe.png",
    "featureImage": "https://i.ibb.co/VVjGbNy/deluxe-feature.jpg",
    "petsAllowed": true,
    "childrenAndExtraBeds": true,
    "extraServices": ["Bar & Pub", "Summer terrace"]
  },
  {
    "category": "Suite",
    "description": "Indulge in pure luxury with our Suites. These opulent accommodations feature a spacious living room, a fully equipped kitchen, and a private balcony offering breathtaking views. Ideal for families or those seeking a lavish retreat, our Suites ensure an unforgettable stay. Priced at $200 per night, these suites can accommodate up to four guests with two beds for a restful night's sleep. Pets are not allowed in our Suites, maintaining a pristine environment. If you're traveling with children or in need of extra beds, our Suites cater to your requirements. Moreover, our extra services, including a summer terrace and a health club, elevate your stay to a whole new level of luxury.",
    "pricePerNight": 200,
    "personCapacity": 4,
    "numBeds": 2,
    "roomImages": "https://i.ibb.co/ZW63kkN/sweet-room.webp",
    "featureImage": "https://i.ibb.co/WtQh86C/sweet-feature.jpg",
    "petsAllowed": false,
    "childrenAndExtraBeds": true,
    "extraServices": ["Summer terrace", "Health club"]
  },
  {
    "category": "Single Room",
    "description": "Find solace in our Single Rooms, thoughtfully designed for solo travelers. These comfortable havens come with essential amenities to ensure a peaceful stay. Whether you're on a business trip or a personal adventure, our Single Rooms cater to your every need. Priced at $80 per night, these rooms are perfect for single travelers, providing a cozy and private space for your stay. The room includes a single bed for a comfortable night's rest, and we allow pets to join you during your solo journey. We maintain a child-free environment to ensure a peaceful and relaxing experience for our guests.These extended descriptions provide a more comprehensive overview of the features, pricing, and suitability of each room category.",
    "pricePerNight": 80,
    "personCapacity": 1,
    "numBeds": 1,
    "roomImages": "https://i.ibb.co/FXqNZpd/single.jpg",
    "featureImage": "https://i.ibb.co/fNvT6Dy/single-feature.jpg",
    "petsAllowed": true,
    "childrenAndExtraBeds": false,
    "extraServices": []
  },
  {
    "category": "Double Room",
    "description": "Experience spaciousness and modern comfort in our Double Rooms. These well-appointed rooms feature a king-sized bed, offering a luxurious and peaceful night's sleep. With a price of $120 per night, these rooms are perfect for couples seeking a convenient retreat. You'll find a range of amenities that include Wi-Fi, a TV, and a private bathroom to enhance your stay. Feel free to bring your pets along as we warmly welcome them. If you're traveling with children or need extra beds, we've got you covered. Additionally, our extra services, such as a bar and pub and a fitness room, will elevate your experience to a new level of comfort.",
    "pricePerNight": 120,
    "personCapacity": 2,
    "numBeds": 1,
    "roomImages": "https://i.ibb.co/D1Xp2qy/pexels-skylar-kang-6045204.jpg",
    "featureImage": "https://i.ibb.co/k0hVtKD/pexels-jean-van-der-meulen-3753435.jpg",
    "petsAllowed": true,
    "childrenAndExtraBeds": true,
    "extraServices": ["Bar & Pub", "Fitness room"]
  },
  {
    "category": "Twin Room",
    "description": "Enjoy modern amenities and comfort in our Twin Rooms, perfect for friends or family travelers. These rooms offer the convenience and space you need for a relaxing stay, with two comfortable twin beds ensuring a restful night's sleep. Priced at $120 per night, these rooms are designed for two guests and come with essential amenities, including Wi-Fi, a TV, and a private bathroom. Pets are not allowed in our Twin Rooms, maintaining a serene atmosphere. If you're traveling with children or need extra beds, our Twin Rooms are the perfect choice. We also provide extra services such as a summer terrace to enhance your stay.",
    "pricePerNight": 120,
    "personCapacity": 2,
    "numBeds": 2,
    "roomImages": "https://i.ibb.co/9NxmjHX/twin.jpg",
    "featureImage": "https://i.ibb.co/qd7JW38/twin-feature.jpg",
    "petsAllowed": false,
    "childrenAndExtraBeds": true,
    "extraServices": ["Summer terrace"]
  },
  {
    "category": "King Suite",
    "description": "Experience sheer luxury in our King Suites. These spacious accommodations feature a king-sized bed, a private living room, and a balcony offering stunning views. Priced at $250 per night, our King Suites can accommodate up to four guests with two beds, ensuring a regal night's rest. The suites offer a range of amenities, including Wi-Fi, a TV, a private bathroom, a living room, and a kitchen. You can enjoy the convenience of a balcony, perfect for taking in the breathtaking views. Pets are welcome in our King Suites, and we provide extra services such as a bar and pub, a casino, and a health club to elevate your experience.",
    "pricePerNight": 250,
    "personCapacity": 4,
    "numBeds": 2,
    "roomImages": "https://i.ibb.co/vYrXDLY/king-suite.jpg",
    "featureImage": "https://i.ibb.co/2qBmg8c/king-suite-feature.jpg",
    "petsAllowed": true,
    "childrenAndExtraBeds": true,
    "extraServices": ["Bar & Pub", "Casino", "Health club"]
  },
  {
    "category": "Queen Suite",
    "description": "Experience regal luxury in our Queen Suites. These lavish accommodations feature a queen-sized bed, a spacious living room, and a private balcony. Priced at $220 per night, these suites can accommodate up to four guests with two beds for a comfortable night's sleep. The facilities include Wi-Fi, a TV, a private bathroom, and a living room, ensuring a luxurious stay. You can step out onto your private balcony to enjoy the fresh air. Pets are not allowed in our Queen Suites to maintain a serene atmosphere. Traveling with children or in need of extra beds? Our Queen Suites have got you covered, and we offer extra services such as a bar and pub, a summer terrace, and a fitness room.",
    "pricePerNight": 220,
    "personCapacity": 4,
    "numBeds": 2,
    "roomImages": "https://i.ibb.co/tZZdCrg/queen.jpg",
    "featureImage": "https://i.ibb.co/P69vw5k/queen-feature.jpg",
    "petsAllowed": false,
    "childrenAndExtraBeds": true,
    "extraServices": ["Bar & Pub", "Summer terrace", "Fitness room"]
  },
  {
    "category": "Family Room",
    "description": "Discover comfort and space in our Family Rooms. These spacious accommodations come with multiple beds, a living area, and a private balcony for a delightful family stay. Priced at $180 per night, these rooms can accommodate up to four guests with three beds, ensuring a cozy night's sleep. The facilities include Wi-Fi, a TV, a private bathroom, and a living room, providing convenience for the whole family. Pets are welcome in our Family Rooms, creating a welcoming atmosphere for your beloved companions. If you're traveling with children or need extra beds, our Family Rooms are the perfect choice. We also offer extra services, such as a bar and pub, a summer terrace, a health club, and luggage storage to enhance your family's stay.These extended descriptions provide a more comprehensive overview of the features, pricing, and suitability of each room category.",
    "pricePerNight": 180,
    "personCapacity": 4,
    "numBeds": 3,
    "roomImages": "https://i.ibb.co/FKXMRHN/family.jpg",
    "featureImage": "https://i.ibb.co/yhRLYfp/family-feature.jpg",
    "petsAllowed": true,
    "childrenAndExtraBeds": true,
    "extraServices": ["Bar & Pub", "Summer terrace", "Health club", "Luggage storage"]
  },
  {
    "category": "Executive Suite",
    "description": "Experience the epitome of luxury in our Executive Suites. These accommodations redefine opulence, offering a spacious living area, a fully equipped kitchen, and a private balcony with panoramic views. Priced at $280 per night, the Executive Suites are designed to cater to guests seeking the highest levels of comfort, style, and convenience. With a person capacity of four and two beds, you'll have ample space to relax and unwind. The rooms are equipped with essential facilities, including Wi-Fi, a TV, a private bathroom, a living room, a kitchen, and a balcony, ensuring a comfortable and indulgent stay. Whether you're traveling with pets or require extra beds for children or companions, we warmly welcome your needs. Our extra services are extensive and tailored to elevate your stay, encompassing a bar and pub for socializing, a casino for entertainment, a summer terrace for relaxation, a health club for the fitness-conscious, luggage storage, and a fitness room.",
    "pricePerNight": 280,
    "personCapacity": 4,
    "numBeds": 2,
    "roomImages": "https://i.ibb.co/VgXwVnj/executive.jpg",
    "featureImage": "https://i.ibb.co/JnmkMkq/executive-feature.jpg",
    "petsAllowed": true,
    "childrenAndExtraBeds": true,
    "extraServices": ["Bar & Pub", "Casino", "Summer terrace", "Health club", "Luggage storage", "Fitness room"]
  },
  {
    "category": "Junior Suite",
    "description": "Revel in relaxation in our Junior Suites. These accommodations are designed for guests seeking serenity and comfort during their stay. Priced at $180 per night, Junior Suites offer a person capacity of two with a single bed, creating an intimate and peaceful ambiance. The rooms are thoughtfully furnished with essential facilities, including Wi-Fi, a TV, a private bathroom, a living room, and a private balcony. While pets are not allowed in our Junior Suites, the absence of furry companions ensures tranquility. Traveling with children or in need of extra beds? We've got you covered. Our extra services include a bar and pub for socializing, a summer terrace for relaxation, and luggage storage to enhance your stay.",
    "pricePerNight": 180,
    "personCapacity": 2,
    "numBeds": 1,
    "roomImages": "https://i.ibb.co/BgNR3vT/junior.jpg",
    "featureImage": "https://i.ibb.co/16tmpwT/junior-feature.jpg",
    "petsAllowed": false,
    "childrenAndExtraBeds": true,
    "extraServices": ["Bar & Pub", "Summer terrace", "Luggage storage"]
  },
  {
    "category": "Connecting Rooms",
    "description": "Adjoining rooms with a connecting door, ideal for families or groups traveling together. With a price of $180 per night, these rooms provide excellent value for those who need extra space and connectivity during their stay. Each room can accommodate up to four people, making it an excellent choice for larger groups. You'll find two comfortable beds in each room, ensuring a good night's sleep for everyone. The rooms are equipped with essential facilities, including Wi-Fi, a TV, a private bathroom, and the unique feature of a connecting door. The room images showcase the well-furnished and spacious interiors, providing a glimpse of the comfort and convenience you can expect. The connecting rooms feature a pet-friendly policy, welcoming your furry companions during your stay. If you're traveling with children or need extra beds, these rooms can accommodate your requirements. Moreover, the 'Connecting Rooms' category offers a range of extra services to enhance your stay, including a bar and pub for socializing, a casino for entertainment, a summer terrace for relaxation, a health club for fitness enthusiasts, luggage storage, and a fitness room. Whether you're on a family vacation or a group adventure, the 'Connecting Rooms' category ensures a hassle-free and enjoyable stay, offering all the amenities and services you need for a memorable experience.",
    "pricePerNight": 180,
    "personCapacity": 4,
    "numBeds": 2,
    "roomImages": "https://i.ibb.co/X821xvD/cooonnecting.jpg",
    "featureImage": "https://i.ibb.co/19psrm2/connectifturre.jpg",
    "petsAllowed": true,
    "childrenAndExtraBeds": true,
    "extraServices": ["Bar & Pub", "Casino", "Summer terrace", "Health club", "Luggage storage", "Fitness room"]
  }
 ]